{
  "Тест_для": "Тест для IT-специалистов",
  "Время": "мин",
  "Вопросов": "вопроса(ов)",
  "Блока": "блока вопросов",
  "Добро_пожаловать": "Приветствуем вас на сайте по тестированию IT-специалистов, где вы можете проверить свои навыки и знания.",
  "Тест_будет": "Выберите направление, а затем пройдите тестирование. По его завершению будет доступна статистика результатов. ",
  "Начать тест": "Начать тест",
  "Что_получите": "Что вы получите?",
  "Как_проходить": "Правила прохождения теста",
  "Пройти_тест": "1. Вы можете вернуться только на один вопрос назад и изменить свой ответ. 2. На каждый вопрос есть только один правильный ответ, несколько вариантов выбрать нельзя. 3. Вы можете приостановить время, нажав кнопку 'Пауза', и в любой момент вернуться к тесту. 4. Тест не ограничен по времени. 5. Тест состоит из нескольких разделов (блоков) с вопросами различной тематики.",
  "Результаты_теста": "Результаты теста",
  "Благодаря_вопросам": "Благодаря специальным вопросам, вы сможете по новому взглянуть на освоенный вами материал. Также вы сможете оценить свои знания по каждой из тем, и увидеть, какой теме требуется еще уделить внимание.  ",
  "После_прохождения": "После прохождения тестирования Вам будет доступна информация о результатах тестирования: количество набранных баллов, затраченное время на тест, пояснения к каждому ответу, уровень знаний по каждому блоку вопросов",
  "Сообщить": "Сообщить об ошибке",
  "Восстановить": "Восстановить результат",
  "Политика": "Политика конфиденциальности",
  "Если_вы_нашли_ошибку": "Если вы нашли ошибку на сайте, то пожалуйста сообщите об этом. Для этого создайте Issue с подробным комментарием на платформе <a target=\"_blank\" href=\"https://github.com/AlbShar/quizFrontend/issues\">GitHub</a>.  Прикрепите скриншот с ошибкой и подробно опишите при каких обстоятельствах возникла ошибка. ",
  "Нашли_ошибку": "Нашли ошибку на сайте или в тесте?",
  "Принять": "Далее",
  "Вопрос": "Вопрос",
  "Прекрасная_работа": "Прекрасная работа!",
  "Учли_ваши_результаты": "Мы уже учли ваши ответы, осталось заполнить небольшую форму. Ваши данные абсолютно конфиденциальны и используются только для максимально объективной валидации результата.",
  "Ваше_имя": "Имя и фамилия",
  "Возраст": "Возраст",
  "Пол": "Пол",
  "Получить_результат": "Получить результат",
  "Протестировано": "Всего протестировано",
  "Пауза": "Пауза",
  "Заголовок1_вышло_время": "К сожалению, Ваше время вышло!",
  "Заголовок2_вышло_время": "Продолжайте решать тест дальше. В связи с тем, что время закончилось Ваше результат будет снижен.",
  "Заголовок1_пауза": "Выполнение теста приостановлено",
  "Заголовок2_пауза": "Вы можете сделать небольшую паузу и продолжить тест позже. Ваш прогресс будет сохранен.",
  "Варианты_ответов": "Варианты ответов",
  "Ваш_ответ": "Ваш ответ",
  "Правильный_ответ": "Правильный ответ",
  "Объяснение": "Объяснение",
  "Ответы": "Ответы",
  "Ваш_результат": "Ваш результат",
  "Затраченное_время": "Затраченное время",
  "Подпись_столбчатая_диаграмма": "График отображает процент правильных ответов по каждому тематическому разделу. Показатель считается как отношение количества верных ответов к общему количеству вопросов тематики. Если показатель менее 50 %, то данный раздел необходимо изучить дополнительно.",
  "Подпись_круговая_диаграмма": "График отображает процент вопросов, на которые были даны верные и неверные ответы",
  "сек": "сек",
  "мин": "мин",
  "из": "из",
  "назад": "назад",
  "направление_теста": "направление теста",
  "Frontend_разработчик": "Frontend разработчик",
  "Тестировщик_ПО": "Тестировщик ПО",
  "Менеджер": "Менеджер",
  "Прошли_тест": "Прошли тест",
  "Закончить_тест": "Закончить тест",
  "Ссылка": "Ссылка",
  "Все вопросы": "Все вопросы",
  "Все тематики": "Все тематики",
  "Верно": "Верно",
  "Неверно": "Неверно"
}