{
    "Тест_для_Frontend_разработчиков": "Тест для Frontend разработчиков",
    "Время": "мин",
    "Вопросов": "вопросов",
    "Возрастающая_сложность": "Возрастающая сложность",
    "Добро_пожаловать": "Добро пожаловать на сайт по проверке знаний Frontend разработчиков. Просим Вас перед началом теста убедиться, что Вас ничего не отвлекает.",
    "Тест_будет": "Чтобы успешно пройти тест Вам нужно правильно ответить на 85% вопросов. Если вы не уложитесь за отведенное время, то Ваш результат будет снижен на 3 балла. После прохождения тестирования вы получите результаты и советы по тому, какие темы Вам нужно подтянуть в сфере Frontend разработки.",
    "Начать_тест": "Начать тест",
    "Особенности_теста": "Общая информация о тесте",
    "Цель_теста": "Как проходить тест?",
    "Результаты_теста": "Результаты теста",
    "Вопросы_тест": "Вопросы для теста: сколько их должно быть?",
    "Тест_состоит": "Данный тест предназначен для как начинающих, так и для опытных Frontend разработчиков. Новичкам этот тест поможет лучше подготовиться к собеседованиям, а более опытным специалистам проверить свой уровень знаний. Вопросы направлены на проверку теоретических и практических знаний Фронтенд разработчиков. Теоретические вопросы в основном взяты из  <a target=\"_blank\" href=\"https://github.com/YauhenKavalchuk/interview-questions\">репозитория Евгения Ковульчка</a>. Они включают общие вопросы по Веб технологии, парадигмам программирования, архитектуре приложений, языку программирования Javascript и библиотеке React. Практические вопросы позаимстваны из телеграмм канала <a target=\"_blank\" href=\"https://t.me/frontend_tests\">Frontend Tests & Tasks</a>.",
    "Основная_цель": "После прохождения тестирования вы узнаете набранное количество баллов и общее затраченное время. Также будут показаны графики, где будут отображены Ваши результаты по каждому тематическому разделу. Это позволит Вам лучше понять в какой области Frontend разработки необходимо улучшить знания. Помните, что даже успешное прохождение тестирования не гарантирует успех на собеседовании. Тестирование направлено лишь на закрепление базовых знаний в Фронтнед разработке. Удачи Вам!",
    "Для_оценки": "Для оценки знаний необходимое количество вопросов должно быть в пределах от 30 до 50. Меньшее количество вопросов не дает возможность точно оценить уровень знаний человека. Потому популярные в интернете тесты на 3, 5 или 10 вопросов не могут дать точную оценку. Использовании для теста более 50 вопросов увеличивает длительность прохождения теста, что в дальнейшем влечет за собой потерю концентрации. Потому оптимальным являются границы от 30 до 50 вопросов. Поэтому на данном сайте используется 40 вопросов.",
    "Сообщить": "Сообщить об ошибке",
    "Восстановить": "Восстановить результат",
    "Политика": "Политика конфиденциальности",
    "Если_вы_нашли_ошибку": "Если вы нашли ошибку на сайте, то пожалуйста сообщите об этом. Для этого создайте Issue с подробным комментарием на платформе <a target=\"_blank\" href=\"https://github.com/AlbShar/quizFrontend/issues\">GitHub</a>.  Прикрепите скриншот с ошибкой и подробно опишите при каких обстоятельствах возникла ошибка. ",
    "Нашли_ошибку": "Нашли ошибку на сайте или в тесте?"
}