{
    "Тест_для_Frontend_разработчиков": "Тест для Frontend разработчиков",
    "40_мин": "40 мин",
    "40_вопросов": "40 вопросов",
    "Возрастающая_сложность": "Возрастающая сложность",
    "Добро_пожаловать": "Добро пожаловать на сайт по проверке знаний Frontend разработчиков. Просим Вас перед началом теста убедиться, что Вас ничего не отвлекает.",
    "Тест_будет": "Тест будет состоять из 40 вопросов. На его прохождение у Вас будет 60 минут. После его прохождения вы получите результаты тестирования и советы по тому, какие темы Вам нужно подтянуть в сфере Frontend разработки.",
    "Начать_тест": "Начать тест",
    "Особенности_теста": "Особенности теста",
    "Цель_теста": "Цель теста",
    "Результаты_теста": "Результаты теста",
    "Вопросы_тест": "Вопросы для теста: сколько их должно быть?",
    "Тест_состоит": "Тест состоит из 40 вопросов, который может быть использован как начинающими так и опытными Frontend разработчиками для оценик их навыков знаний. Данный тест позволит начинающим разработчикам подготовиться к собеседованиям, а более опытным специалистам проверить свой уровень знаний. База данных содержит около 300 вопросов, которые взяты из реальных собеседований, а также из открытых источниках в сети Интернет. Из них программа произвольно выберет 40 вопрос различной тематики. Вопросы разделены по группам: 1) HTML, CSS (10 вопросов), 2) JS (20 вопросов) 3) React (20 вопросов). Для того, чтобы пройти тест Вам нужно правильно ответить на 85% вопросов (34 вопроса). После прохождения теста вы узнаете какие области Frontend разработки Вам необходимо подтянуть.",
    "Данный_тест": "Данный тест можно использовать для самых различных целей, в том числе: - Подготовка к собеседованиям; - Оценка кандидата при приеме на должность Frontend разработчика; - Оценка собственный знаний и навыков в области Frontend разработки;",
    "Основная_цель": "Основная цель тестирования заключается не только в определении знаний и навыков человека в области Frontend разработки, но и в определении навыков, в которых человек преуспевает или нуждается в дополнительном внимании. Данный тест помогает определить способности в таких областях: - Верстка (HTML, CSS); - Знание нативного языка программирования Javascript; - Знание библоитеки React;",
    "Для_оценки": "Для оценки знаний необходимое количество вопросов должно быть в пределах от 30 до 50. Меньшее количество вопросов не дает возможность точно оценить уровень знаний человека. Потому популярные в интернете тесты на 3, 5 или 10 вопросов не могут дать точную оценку. Использовании для теста более 50 вопросов увеличивает длительность прохождения теста, что в дальнейшем влечет за собой потерю концентрации. Потому оптимальным являются границы от 30 до 50 вопросов. Поэтому на данном сайте используется 40 вопросов.",
    "О_нас": "О нас",
    "Восстаовить": "Восстановить мой результат",
    "Политика": "Политика конфиденциальности"
}