{
    "Тест_для_Frontend_разработчиков": "Test für Frontend-Entwickler",
    "Время": "min",
    "Вопросов": "Fragen",
    "Возрастающая_сложность": "Steigende Komplexität",
    "Добро_пожаловать": "Willkommen auf der Seite zum Überprüfen des Wissens von Frontend-Entwicklern. Wir bitten Sie, darauf zu achten, dass Sie durch nichts abgelenkt werden, bevor Sie mit dem Test beginnen.",
    "Тест_будет": "Um den Test erfolgreich zu bestehen, müssen Sie 85 % der Fragen richtig beantworten. Wenn Sie die vorgegebene Zeit nicht einhalten, wird Ihr Ergebnis um 3 Punkte reduziert. Nach bestandener Prüfung erhalten Sie die Ergebnisse und Hinweise, welche Themen Sie im Bereich Frontend-Entwicklung verbessern müssen.",
    "Начать_тест": "Test starten",
    "Особенности_теста": "Allgemeine Informationen zum Test",
    "Как_проходить": "Wie bestehe ich die Prüfung?",
    "Пройти_тест": "Um den Test zu bestehen, müssen Sie 85 % der Fragen richtig beantworten. Es gibt nur eine richtige Antwort auf jede Frage, Sie können nicht mehrere Optionen auswählen. Sie können nur eine Frage zurückgehen und Ihre Antwort ändern. Der Test ist zeitlich begrenzt und wenn Sie die vorgegebene Zeit nicht einhalten, wird Ihr Ergebnis gekürzt. Aber auch nach Ablauf der Zeit können Sie den Test bis zum Ende bestehen. Beim Testen empfehlen wir Ihnen, sich voll und ganz auf die Fragen zu konzentrieren und sich nicht von äußeren Faktoren ablenken zu lassen, da der Zeitaufwand für jede Frage in den Empfehlungen berücksichtigt wird, welche Bereiche der Frontend-Entwicklung Sie wiederholen müssen. Bei der Beantwortung von Fragen empfehlen wir, nicht auf die vorgeschlagenen Antworten zu schauen, sondern zunächst zu versuchen, die Frage selbst zu beantworten und somit die richtige Option zu wählen. Stellen Sie sich vor, dass Ihnen diese Frage bei einem Vorstellungsgespräch gestellt wird und Sie keine Antwortmöglichkeiten haben.",
    "Результаты_теста": "Testergebnisse",
    "Вопросы_тест": "Fragen für den Test: Wie viele sollen es sein?",
    "Данный_тест": "Dieser Test richtet sich sowohl an Einsteiger als auch an erfahrene Frontend-Entwickler. Dieser Test hilft Anfängern, sich besser auf Vorstellungsgespräche vorzubereiten, und erfahrenen Berufstätigen, ihren Wissensstand zu überprüfen. Die Fragen zielen darauf ab, das theoretische und praktische Wissen von Frontend-Entwicklern zu testen. Theoretische Fragen stammen hauptsächlich aus dem <a target=\"_blank\" href=\"https://github.com/YauhenKavalchuk/interview-questions\">Repository von YauhenKovulchko</a>. Sie umfassen allgemeine Fragen zu Webtechnologie, Programmierparadigmen, Anwendungsarchitektur, der Programmiersprache Javascript und der React-Bibliothek. Praktische Fragen aus-Telegrammen <a target=\"_blank\" href=\"https://t.me/frontend_tests\">Frontend-Tests und -Aufgaben</a>.",
    "После_прохождения": "Nach bestandenem Test erfahren Sie die Anzahl der erzielten Punkte und die insgesamt aufgewendete Zeit. Es werden auch Grafiken angezeigt, in denen Ihre Ergebnisse für jeden Themenbereich angezeigt werden. Dadurch können Sie besser verstehen, in welchem ​​Bereich der Frontend-Entwicklung Sie Ihr Wissen verbessern müssen. Denken Sie daran, dass selbst das Bestehen des Tests noch keinen Erfolg im Vorstellungsgespräch garantiert. Das Testen dient lediglich der Festigung von Grundkenntnissen in der Frontend-Entwicklung. Viel Erfolg!",
    "Для_оценки": "Zur Wissenseinschätzung sollte die erforderliche Anzahl an Fragen im Bereich von 30 bis 50 liegen. Eine geringere Anzahl an Fragen erlaubt keine genaue Einschätzung des Wissensstandes einer Person. Daher können im Internet beliebte Tests für 3, 5 oder 10 Fragen keine genaue Einschätzung geben. Die Verwendung von mehr als 50 Fragen für den Test verlängert die Testdauer, was einen weiteren Konzentrationsverlust zur Folge hat. Daher liegt der optimale Bereich zwischen 30 und 50 Fragen. Daher verwendet diese Seite 40 Fragen.",
    "Сообщить": "Melde einen technischen Fehler",
    "Восстановить": "Mein Ergebnis wiederherstellen",
    "Политика": "Datenschutzrichtlinie",
    "Если_вы_нашли_ошибку": "Wenn Sie einen Fehler auf der Website finden, melden Sie ihn bitte. Erstellen Sie dazu ein Issue mit einem ausführlichen Kommentar auf der <a target=\"_blank\" href=\"https://github.com/AlbShar/quizFrontend/issues\">GitHub</a>. Hängen Sie einen Screenshot mit einem Fehler an und beschreiben Sie detailliert, unter welchen Umständen der Fehler aufgetreten ist.",
    "Нашли_ошибку": "Fehler auf der Seite oder im Test gefunden?",
    "Принять": "Akzeptieren",
    "Вопрос": "Frage",
    "Прекрасная_работа": "Gut gemacht!",
    "Учли_ваши_результаты": "Wir haben Ihre Antworten bereits berücksichtigt, es bleibt noch ein kleines Formular auszufüllen. Ihre Daten werden absolut vertraulich behandelt und nur zur möglichst objektiven Validierung des Ergebnisses verwendet.",
    "Ваше_имя": "Ihr Name",
    "Возраст": "Alter",
    "Пол": "Geschlecht",
    "Получить_результат": "Ergebnis abrufen",
    "Протестировано": "Insgesamt getestet"


}