{
    "Тест_для_Frontend_разработчиков": "Test für Frontend-Entwickler",
    "Время": "min",
    "Вопросов": "Fragen",
    "Возрастающая_сложность": "Steigende Komplexität",
    "Добро_пожаловать": "Willkommen auf der Seite zum Überprüfen des Wissens von Frontend-Entwicklern. Wir bitten Sie, darauf zu achten, dass Sie durch nichts abgelenkt werden, bevor Sie mit dem Test beginnen.",
    "Тест_будет": "Um den Test erfolgreich zu bestehen, müssen Sie 85 % der Fragen richtig beantworten. Wenn Sie die vorgegebene Zeit nicht einhalten, wird Ihr Ergebnis um 3 Punkte reduziert. Nach bestandener Prüfung erhalten Sie die Ergebnisse und Hinweise, welche Themen Sie im Bereich Frontend-Entwicklung verbessern müssen.",
    "Начать_тест": "Test starten",
    "Особенности_теста": "Testfunktionen",
    "Цель_теста": "Zweck des Tests",
    "Результаты_теста": "Testergebnisse",
    "Вопросы_тест": "Fragen für den Test: Wie viele sollen es sein?",
    "Тест_состоит": "Der Test besteht aus 40 Fragen, mit denen sowohl Einsteiger als auch erfahrene Frontend-Entwickler ihre Wissenskompetenzen einschätzen können. Dieser Test ermöglicht es unerfahrenen Entwicklern, sich auf Vorstellungsgespräche vorzubereiten, und erfahreneren Fachleuten, ihren Wissensstand zu überprüfen. Die Datenbank enthält etwa 300 Fragen, die aus realen Interviews sowie aus offenen Quellen im Internet stammen. Aus diesen wählt das Programm zufällig 40 Fragen zu verschiedenen Themen aus. Die Fragen sind in Gruppen eingeteilt: 1) HTML, CSS (10 Fragen), 2) JS (20 Fragen) 3) Reagieren (20 Fragen). Um den Test zu bestehen, müssen Sie 85 % der Fragen richtig beantworten (34 Fragen). Nach bestandener Prüfung erfahren Sie, in welchen Bereichen der Frontend-Entwicklung Sie sich verbessern müssen.",
    "Данный_тест": "Dieser Test kann für eine Vielzahl von Zwecken verwendet werden, darunter: - Vorbereitung auf Vorstellungsgespräche; - Bewertung des Kandidaten bei der Bewerbung um die Stelle des Frontend-Entwicklers; - Einschätzung der eigenen Kenntnisse und Fähigkeiten im Bereich Frontend-Entwicklung;",
    "Основная_цель": "Der Hauptzweck des Testens besteht nicht nur darin, die Kenntnisse und Fähigkeiten einer Person im Bereich der Frontend-Entwicklung zu ermitteln, sondern auch die Fähigkeiten zu ermitteln, in denen sich eine Person auszeichnet oder zusätzliche Aufmerksamkeit benötigt. Dieser Test hilft, Fähigkeiten in folgenden Bereichen festzustellen: - Layout (HTML, CSS); - Kenntnisse der nativen Javascript-Programmiersprache; - Kenntnisse der React-Bibliothek;",
    "Для_оценки": "Zur Wissenseinschätzung sollte die erforderliche Anzahl an Fragen im Bereich von 30 bis 50 liegen. Eine geringere Anzahl an Fragen erlaubt keine genaue Einschätzung des Wissensstandes einer Person. Daher können im Internet beliebte Tests für 3, 5 oder 10 Fragen keine genaue Einschätzung geben. Die Verwendung von mehr als 50 Fragen für den Test verlängert die Testdauer, was einen weiteren Konzentrationsverlust zur Folge hat. Daher liegt der optimale Bereich zwischen 30 und 50 Fragen. Daher verwendet diese Seite 40 Fragen.",
    "Сообщить": "Melde einen technischen Fehler",
    "Восстаовить": "Mein Ergebnis wiederherstellen",
    "Политика": "Datenschutzrichtlinie"


}