{
  "Тест_для": "Test for IT-specialists",
  "Время": "min",
  "Вопросов": "questions",
  "Блока": "blocks questions",
  "Добро_пожаловать": "Welcome to the IT testing site where you can test your skills and knowledge.",
  "Начать тест": "Start test",
  "Тест_будет": "Welcome to the IT testing site where you can test your skills and knowledge. Choose a direction, and then take the test. Upon its completion, statistics of the results will be available.",
  "Что_получите": "What will you get?",
  "Как_проходить": "Test rules",
  "Результаты_теста": "Test results",
  "Пройти_тест": "1. You can only go back one question and change your answer. 2. There is only one correct answer for each question, multiple options cannot be selected. 3. You can pause the time by pressing the 'Pause' button and return to the test at any time. 4. The test is not limited in time. 5. The test consists of several sections (blocks) with questions on various topics.",
  "Благодаря_вопросам": "Thanks to special questions, you will be able to take a fresh look at the material you have mastered. You will also be able to evaluate your knowledge on each of the topics, and see which topic needs more attention. Thanks to the final report, you can clearly see where your gaps in knowledge or skills are, and focus on them",
  "После_прохождения": "After passing the test, you will have access to information about the test results: the number of points scored, the time spent on the test, explanations for each answer, the level of knowledge for each block of questions",
  "Для_оценки": "To assess knowledge, the required number of questions should be in the range from 30 to 50. A smaller number of questions does not make it possible to accurately assess the level of knowledge of a person. Therefore, tests popular on the Internet for 3, 5 or 10 questions cannot give an accurate assessment. Using more than 50 questions for the test increases the duration of the test, which further entails a loss of concentration. Therefore, the optimal range is from 30 to 50 questions. Therefore, this site uses 40 questions.",
  "Сообщить": "Report a bug",
  "Восстановить": "Restore My Score",
  "Политика": "Privacy Policy",
  "Если_вы_нашли_ошибку": "If you find an error on the site, please report it. To do this, create an Issue with a detailed comment on the <a target=\"_blank\" href=\"https://github.com/AlbShar/quizFrontend/issues\">GitHub</a>. Attach a screenshot with an error and describe in detail under what circumstances the error occurred.",
  "Нашли_ошибку": "Found an error on the site or in the test?",
  "Принять": "Next",
  "Вопрос": "Question",
  "Обратная_связь": "Feedback",
  "Учли_ваши_результаты": "If you want to report an error or change the questions for the test, then fill in the fields below and write to e-mail.",
  "Ваше_имя": "Name and surname",
  "Возраст": "Age",
  "Пол": "Gender",
  "Получить_результат": "Get result",
  "Протестировано": "Total Tested",
  "Пауза": "Pause",
  "Заголовок1_вышло_время": "Unfortunately, your time is up!",
  "Заголовок2_вышло_время": "Keep solving the test further. Due to the fact that the time is up, your result will be lowered.",
  "Заголовок1_пауза": "Test execution has been suspended",
  "Заголовок2_пауза": "You can take a short break and continue the test later.",
  "Варианты_ответов": "Варианты ответов",
  "Ваш_ответ": "Your answer",
  "Правильный_ответ": "Right answer",
  "Объяснение": "Explanation",
  "Ответы": "Answers",
  "Ваш_результат": "Your score",
  "Затраченное_время": "Spent time",
  "Подпись_столбчатая_диаграмма": "The graph displays the percentage of correct answers for each topic section. The indicator is calculated as the ratio of the number of correct answers to the total number of topics. If it is less than 50%, then this section needs further study.",
  "Подпись_круговая_диаграмма": "The graph shows the percentage of questions that were answered correctly and incorrectly.",
  "сек": "sec",
  "мин": "min",
  "из": "from",
  "назад": "back",
  "направление_теста": "direction",
  "Frontend_разработчик": "Frontend developer",
  "Тестировщик_ПО": "QA engineer",
  "Менеджер": "Manager",
  "Прошли_тест": "Total Tested",
  "Закончить_тест": "Finish test",
  "Ссылка": "Link",
  "Сайт_по_тестированию": "An IT testing site where you can test your skills and knowledge.",
  "Оценка_знаний": "Assessing your knowledge",
  "Благодаря_вопросам": "Thanks to special questions, you will be able to take a fresh look at the material you have mastered.",
  "Выявление_слабых_мест": "Identification of weaknesses",
  "Cможете_оценить_знания": "You will be able to evaluate your knowledge of each of them, and see which topic needs more attention.",
  "Отчет": "Results Report",
  "В_финальном_отчёте": "In the final report, you can clearly see where your gaps in knowledge or skills are, and focus on them",
  "О_тесте": "About the test, about the site, about us",
  "Приветствуем_на_сайте": "Welcome to the IT testing site where you can test your skills and knowledge",
  "По_завершению": "Upon completion, results statistics will be available.",
  "Сообщить_об_ошибке": "If you want to report an error or change the questions for the test, then write to us about it go to the page",
  "Напишите": "and write to us about it",
  "Обратная_связь": "Feedback",
  "Команда": "Team",
  "Правила": "Rules"
}
  